{
  "workflows": [
    {
      "name": "video_icon_generation",
      "description": "Generate an icon image for video content. All requirements already specified in the workflow. Any video icon generation will use this workflow.",
      "workflow_io": "inputs are icon description (user provided) and a reference image (already included in the workflow); output is a single png image.",
      "parameters": [
        {
          "name": "icon_description",
          "type": "string",
          "required": true,
          "provided_by": "user",
          "purpose": "A description of the icon to be generated for video",
          "details": "This can be as simple as a single word, or as complex as a detailed description including elements, composition, accent color, etc.",
          "suggestions": "For best results, user should specify the accent color"
        }
      ]
    },
    {
      "name": "square_icon_generation",
      "description": "Generate a square-shaped icon image. All requirements already specified in the workflow. Any square icon generation will use this workflow.",
      "workflow_io": "inputs are icon description (user provided) and a reference image (already included in the workflow); output is a single png image.",
      "parameters": [
        {
          "name": "icon_description",
          "type": "string",
          "required": true,
          "provided_by": "user",
          "purpose": "A description of the square icon to be generated",
          "details": "This can be as simple as a single word, or as complex as a detailed description including elements, composition, accent color, etc.",
          "suggestions": "For best results, user should literally specify the color for the base and element of the icon, e.g., 'use green base and element'"
        }
      ]
    },
    {
      "name": "circle_icon_generation",
      "description": "Generate a circular icon image. All requirements already specified in the workflow. Any circular icon generation will use this workflow.",
      "workflow_io": "inputs are icon description (user provided) and a reference image (already included in the workflow); output is a single png image.",
      "parameters": [
        {
          "name": "icon_description",
          "type": "string",
          "required": true,
          "provided_by": "user",
          "purpose": "A description of the circular icon to be generated",
          "details": "This can be as simple as a single word, or as complex as a detailed description including elements, composition, accent color, etc.",
          "suggestions": "For best results, user should literally specify the color for the base and element of the icon, e.g., 'use green base and element'"
        }
      ]
    },
    {
      "name": "badge_icon_generation",
      "description": "Generate a badge-style icon image. All requirements already specified in the workflow. Any badge icon generation will use this workflow.",
      "workflow_io": "inputs are icon description (user provided) and a reference image (already included in the workflow); output is a single png image.",
      "parameters": [
        {
          "name": "icon_description",
          "type": "string",
          "required": true,
          "provided_by": "user",
          "purpose": "A description of the badge icon to be generated",
          "details": "This can be as simple as a single word, or as complex as a detailed description including elements, composition, accent color, etc.",
          "suggestions": "For best results, user should literally specify the color for the base and element of the icon, e.g., 'use green base and element'"
        }
      ]
    },
    {
      "name": "script_writing",
      "description": "Writing course script. All requirements already specified in the workflow.",
      "workflow_io": "inputs are Course Outline document (required), Course Research Document (required), and any other additional supporting documents (optional), all in Google Docs, all user-provided. Outputs are separate lesson script Google Docs.",
      "parameters": [
        {
          "name": "course_folder_link",
          "type": "URL",
          "required": true,
          "provided_by": "user",
          "purpose": "the folder in which the course script will be stored",
          "details": "This should be a link to the folder where user put course outline and research documents. This folder link will be provided by user.",
          "suggestions": "user may put an additional Google Docs file in the same folder containing nuanced and custom instructions about this script. It could be as detailed as needed"
        }
      ]
    },
    {
      "name": "script_editing",
      "description": "Editing course script. All requirements already specified in the workflow.",
      "workflow_io": "Inputs are the original script (Google Docs) and editing instructions, all user-provided, NO other additional documents. Output is the edited script and change summary appended to the input script in the same Google Docs.",
      "parameters": [
        {
          "name": "lesson_script_document_id",
          "type": "string",
          "required": true,
          "provided_by": "AI Agent",
          "purpose": "the id of the Google Docs file which contains the lesson script to be edited",
          "details": "This should be the ID of the Google Docs file that contains the lesson script to be edited. You must provide this ID using the `get_file_id` tool based on the folder link (provided by the user) and lesson script filename"
        },
        {
          "name": "editing_message",
          "type": "string",
          "required": true,
          "provided_by": "user",
          "purpose": "include the ways and aspects of the editing from the user",
          "details": "This should include the specific ways and aspects of the editing that the user wants to apply to the lesson script. For example, it can be a request to change the tone, add more details, or correct grammar, etc.",
          "suggestions": "For best results, prompt the user to be specific and accurate in editing instructions. Vague or self-conflicting instructions lead to vague or self-conflicting results"
        }
      ]
    }
  ]
}